obones/max32666toy/audio_regs.h
#define MXC_F_PDM_RX02FIFO_CH0_ALMOST_EMPTY_POS \
    11 /**< MXC_F_PDM_RX02FIFO_CH0_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX02FIFO_CH0_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX02FIFO_CH0_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX02FIFO_CH0_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH1_ALMOST_EMPTY_POS \
    12 /**< MXC_F_PDM_RX1_FIFO_CH1_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH1_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX1_FIFO_CH1_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX1_FIFO_CH1_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH0_ALMOST_EMPTY_POS \
    13 /**< MXC_F_PDM_RX1_FIFO_CH0_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH0_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX1_FIFO_CH0_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX1_FIFO_CH0_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH1_ALMOST_EMPTY_POS \
    14 /**< MXC_F_PDM_TX_FIFO_CH1_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_TX_FIFO_CH1_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_TX_FIFO_CH1_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_TX_FIFO_CH1_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH0_ALMOST_EMPTY_POS \
    15 /**< MXC_F_PDM_TX_FIFO_CH0_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_TX_FIFO_CH0_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_TX_FIFO_CH0_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_TX_FIFO_CH0_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_RX3_FIFO_CH1_HALF_FULL_POS \
    16 /**< MXC_F_PDM_RX3_FIFO_CH1_HALF_FULL_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH1_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX3_FIFO_CH1_HALF_FULL_POS)) /**< MXC_F_PDM_RX3_FIFO_CH1_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX3_FIFO_CH0_HALF_FULL_POS \
    17 /**< MXC_F_PDM_RX3_FIFO_CH0_HALF_FULL_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH0_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX3_FIFO_CH0_HALF_FULL_POS)) /**< MXC_F_PDM_RX3_FIFO_CH0_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX2_FIFO_CH1_HALF_FULL_POS \
    18 /**< MXC_F_PDM_RX2_FIFO_CH1_HALF_FULL_POS Position */
#define MXC_F_PDM_RX2_FIFO_CH1_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX2_FIFO_CH1_HALF_FULL_POS)) /**< MXC_F_PDM_RX2_FIFO_CH1_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX2_FIFO_CH0_HALF_FULL_POS \
    19 /**< MXC_F_PDM_RX2_FIFO_CH0_HALF_FULL_POS Position */
#define MXC_F_PDM_RX2_FIFO_CH0_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX2_FIFO_CH0_HALF_FULL_POS)) /**< MXC_F_PDM_RX2_FIFO_CH0_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH1_HALF_FULL_POS \
    20 /**< MXC_F_PDM_RX1_FIFO_CH1_HALF_FULL_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH1_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX1_FIFO_CH1_HALF_FULL_POS)) /**< MXC_F_PDM_RX1_FIFO_CH1_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH0_HALF_FULL_POS \
    21 /**< MXC_F_PDM_RX1_FIFO_CH0_HALF_FULL_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH0_HALF_FULL \
    ((uint32_t)(0x1UL                    \
                << MXC_F_PDM_RX1_FIFO_CH0_HALF_FULL_POS)) /**< MXC_F_PDM_RX1_FIFO_CH0_HALF_FULL_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH1_HALF_FULL_POS 22 /**< MXC_F_PDM_TX_FIFO_CH1_HALF_FULL_POS Position */
#define MXC_F_PDM_TX_FIFO_CH1_HALF_FULL \
    ((uint32_t)(0x1UL                   \
                << MXC_F_PDM_TX_FIFO_CH1_HALF_FULL_POS)) /**< MXC_F_PDM_TX_FIFO_CH1_HALF_FULL_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH0_HALF_FULL_POS 23 /**< MXC_F_PDM_TX_FIFO_CH0_HALF_FULL_POS Position */
#define MXC_F_PDM_TX_FIFO_CH0_HALF_FULL \
    ((uint32_t)(0x1UL                   \
                << MXC_F_PDM_TX_FIFO_CH0_HALF_FULL_POS)) /**< MXC_F_PDM_TX_FIFO_CH0_HALF_FULL_POS Mask */

#define MXC_F_PDM_RX3_FIFO_CH1_ALMOST_FULL_POS \
    24 /**< MXC_F_PDM_RX3_FIFO_CH1_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH1_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX3_FIFO_CH1_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX3_FIFO_CH1_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_RX3_FIFO_CH0_ALMOST_FULL_POS \
    25 /**< MXC_F_PDM_RX3_FIFO_CH0_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH0_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX3_FIFO_CH0_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX3_FIFO_CH0_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_RX2_FIFO_CH1_ALMOST_FULL_POS \
    26 /**< MXC_F_PDM_RX2_FIFO_CH1_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX2_FIFO_CH1_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX2_FIFO_CH1_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX2_FIFO_CH1_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_RX2_FIFO_CH0_ALMOST_FULL_POS \
    27 /**< MXC_F_PDM_RX2_FIFO_CH0_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX2_FIFO_CH0_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX2_FIFO_CH0_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX2_FIFO_CH0_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH1_ALMOST_FULL_POS \
    28 /**< MXC_F_PDM_RX1_FIFO_CH1_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH1_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX1_FIFO_CH1_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX1_FIFO_CH1_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_RX1_FIFO_CH0_ALMOST_FULL_POS \
    29 /**< MXC_F_PDM_RX1_FIFO_CH0_ALMOST_FULL_POS Position */
#define MXC_F_PDM_RX1_FIFO_CH0_ALMOST_FULL \
    ((uint32_t)(0x1UL                      \
                << MXC_F_PDM_RX1_FIFO_CH0_ALMOST_FULL_POS)) /**< MXC_F_PDM_RX1_FIFO_CH0_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH1_ALMOST_FULL_POS \
    30 /**< MXC_F_PDM_TX_FIFO_CH1_ALMOST_FULL_POS Position */
#define MXC_F_PDM_TX_FIFO_CH1_ALMOST_FULL \
    ((uint32_t)(0x1UL                     \
                << MXC_F_PDM_TX_FIFO_CH1_ALMOST_FULL_POS)) /**< MXC_F_PDM_TX_FIFO_CH1_ALMOST_FULL_POS Mask */

#define MXC_F_PDM_TX_FIFO_CH0_ALMOST_FULL_POS \
    31 /**< MXC_F_PDM_TX_FIFO_CH0_ALMOST_FULL_POS Position */
#define MXC_F_PDM_TX_FIFO_CH0_ALMOST_FULL \
    ((uint32_t)(0x1UL                     \
                << MXC_F_PDM_TX_FIFO_CH0_ALMOST_FULL_POS)) /**< MXC_F_PDM_TX_FIFO_CH0_ALMOST_FULL_POS Mask */

/**@} end of group AUDIO_INT_PDM_STATUS */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_INT_EN AUDIO_INT_EN
 * @brief    Interrupt Enable Register
 * @{
 */

#define MXC_F_EN_AE_PCM_RX_POS 10 /**< MXC_F_EN_AE_PCM_RX Position */
#define MXC_F_EN_AE_PCM_RX ((uint32_t)(0x01UL << MXC_F_EN_AE_PCM_RX_POS)) /**< MXC_F_EN_AE_PCM_RX */

