obones/max32666toy/audio_regs.h
#define MXC_F_EN_AE_PCM_TX_POS 11 /**< MXC_F_EN_AE_PCM_TX Position */
#define MXC_F_EN_AE_PCM_TX ((uint32_t)(0x01UL << MXC_F_EN_AE_PCM_TX_POS)) /**< MXC_F_EN_AE_PCM_TX */

#define MXC_F_EN_HF_PCM_TX_POS 19 /**< MXC_F_EN_HF_PCM_TX Position */
#define MXC_F_EN_HF_PCM_TX ((uint32_t)(0x01UL << MXC_F_EN_HF_PCM_TX_POS)) /**< MXC_F_EN_HF_PCM_TX */

/**@} end of group AUDIO_INT_EN */

/**
 * @ingroup  audio_registers PDM_TX_RATE_SETUP
 * @defgroup PDM_TX_RATE_SETUP PDM_TX_RATE_SETUP
 * @brief    PDM Tx Rate Setup Register
 * @{
 */
#define PDM_TX_CLK_RATE_POS 0  /**< PDM_TX_CLK_RATE position */
#define PDM_TX_CLK_RATE_MCLK_DIV_8 \
        ((uint32_t)(0x00UL << PDM_TX_CLK_RATE_POS))
#define PDM_TX_CLK_RATE_MCLK_DIV_4 \
        ((uint32_t)(0x01UL << PDM_TX_CLK_RATE_POS))
#define PDM_TX_CLK_RATE_MCLK_DIV_2 \
        ((uint32_t)(0x02UL << PDM_TX_CLK_RATE_POS))
#define PDM_TX_CLK_RATE_MCLK \
        ((uint32_t)(0x03UL << PDM_TX_CLK_RATE_POS))

#define PDM_TX_CLK_DATA_SR 2  /**< PDM_TX_CLK_DATA_SR position */
#define PDM_TX_CLK_DATA_SR_PDM_TX_CLK_DIV_8 \
        ((uint32_t)(0x00UL << PDM_TX_CLK_DATA_SR))
#define PDM_TX_CLK_DATA_SR_PDM_TX_CLK_DIV_4 \
        ((uint32_t)(0x01UL << PDM_TX_CLK_DATA_SR))
#define PDM_TX_CLK_DATA_SR_PDM_TX_CLK_DIV_2 \
        ((uint32_t)(0x02UL << PDM_TX_CLK_DATA_SR))
#define PDM_TX_CLK_DATA_SR_PDM_TX_CLK \
        ((uint32_t)(0x03UL << PDM_TX_CLK_DATA_SR))

/**@} end of group PDM_TX_RATE_SETUP */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_MODULATOR_CONTROLS AUDIO_MODULATOR_CONTROLS
 * @brief    Modulator control register
 * @{
 */

#define MXC_F_TX_MOD_ENABLE_POS 0 /**< MXC_F_TX_MOD_ENABLE Position */
#define MXC_F_TX_MOD_ENABLE \
    ((uint32_t)(0x01UL << MXC_F_TX_MOD_ENABLE_POS)) /**< MXC_F_TX_MOD_ENABLE */

#define MXC_F_TX_MONO_ENABLE_POS 1 /**< MXC_F_TX_MONO_ENABLE Position */
#define MXC_F_TX_MONO_ENABLE \
    ((uint32_t)(0x01UL << MXC_F_TX_MONO_ENABLE_POS)) /**< MXC_F_TX_MONO_ENABLE */

#define MXC_F_TX_MOD_BYPASS_POS 2 /**< MXC_F_TX_MOD_BYPASS Position */
#define MXC_F_TX_MOD_BYPASS \
    ((uint32_t)(0x01UL << MXC_F_TX_MOD_BYPASS_POS)) /**< MXC_F_TX_MOD_BYPASS */

#define MXC_F_PDM_TX_ALT_ENCODE_POS 3 /**< MXC_F_PDM_TX_ALT_ENCODE Position */
#define MXC_F_PDM_TX_ALT_ENCODE \
    ((uint32_t)(0x01UL << MXC_F_PDM_TX_ALT_ENCODE_POS)) /**< MXC_F_PDM_TX_ALT_ENCODE */

#define MXC_F_PDM_PCM_SELECT_POS 7 /**< MXC_F_PDM_PCM_SELECT Position */
#define MXC_F_PDM_PCM_SELECT \
    ((uint32_t)(0x01UL << MXC_F_PDM_PCM_SELECT_POS)) /**< MXC_F_PDM_PCM_SELECT */

/**@} end of group AUDIO_MODULATOR_CONTROLS */

/**
 * @ingroup  audio_registers
 * @defgroup PDM_TX_CONTROL_1 PDM_TX_CONTROL_1
 * @brief    PDM Tx Configuration 0
 * @{
 */
#define PDM_TX_2_CH1_HIZ_POS 7
#define PDM_TX_2_CH1_HIZ \
        ((uint32_t)(0x01UL << PDM_TX_2_CH1_HIZ_POS))

#define PDM_TX_2_CH0_HIZ_POS 6
#define PDM_TX_2_CH0_HIZ \
        ((uint32_t)(0x01UL << PDM_TX_2_CH0_HIZ_POS))

#define PDM_TX_2_CH1_EN_POS 5
#define PDM_TX_2_CH1_EN \
        ((uint32_t)(0x01UL << PDM_TX_2_CH1_EN_POS))

#define PDM_TX_2_CH0_POS 4
#define PDM_TX_2_CH0_EN \
        ((uint32_t)(0x01UL << PDM_TX_2_CH0_EN_POS))

#define PDM_TX_1_CH1_HIZ_POS 3
#define PDM_TX_1_CH1_HIZ \
        ((uint32_t)(0x01UL << PDM_TX_1_CH1_HIZ_POS))

#define PDM_TX_1_CH0_HIZ_POS 2
#define PDM_TX_1_CH0_HIZ \
        ((uint32_t)(0x01UL << PDM_TX_1_CH0_HIZ_POS))

#define PDM_TX_1_CH1_EN_POS 1
#define PDM_TX_1_CH1_EN \
        ((uint32_t)(0x01UL << PDM_TX_1_CH1_EN_POS))

#define PDM_TX_1_CH0_EN_POS 0
#define PDM_TX_1_CH0_EN \
        ((uint32_t)(0x01UL << PDM_TX_1_CH0_EN_POS))

/**@} end of group PDM_TX_CONTROL_1 */

/**
 * @ingroup  audio_registers
 * @defgroup PDM_TX_CONTROL_2 PDM_TX_CONTROL_2
 * @brief    PDM Tx Configuration 1
 * @{
 */
#define PDM_TX_EDGE_SEL_POS 1
#define PDM_TX_EDGE_SEL_RISING \
        ((uint32_t)(0x01UL << PDM_TX_EDGE_SEL_POS))

#define PDM_TX_MODE_POS 0
#define PDM_TX_MODE_1_5_BIT \
        ((uint32_t)(0x01UL << PDM_TX_MODE_POS))

/**@} end of group PDM_TX_CONTROL_2 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_CLOCK_DIVIDERS_MSB AUDIO_PCM_CLOCK_DIVIDERS_MSB
 * @brief    PCM Clock Dividers MSB
 * @{
 */

#define MXC_F_PCM_BCLK_DIV_MSB_POS 0 /**< MXC_F_PCM_BCLK_DIV_MSB Position */
#define MXC_F_PCM_BCLK_DIV_MSB \
    ((uint32_t)(0x00UL << MXC_F_PCM_BCLK_DIV_MSB_POS)) /**< MXC_F_PCM_BCLK_DIV_MSB */

#define MXC_F_PCM_BCLK_SEL_POS 5 /**< MXC_F_PCM_BCLK_SEL Position */
#define MXC_F_PCM_BCLK_SEL_BCLK_TICK \
    ((uint32_t)(0x00UL               \
                << MXC_F_PCM_BCLK_SEL_POS)) /**< MXC_F_PCM_BCLK_SEL BCLK generator, tick out*/
#define MXC_F_PCM_BCLK_SEL_BCLK_TOGGLE \
    ((uint32_t)(0x01UL                 \
                << MXC_F_PCM_BCLK_SEL_POS)) /**< MXC_F_PCM_BCLK_SEL BCLK generator, toggle out*/
#define MXC_F_PCM_BCLK_SEL_BCLK_MASTER \
    ((uint32_t)(0x02UL << MXC_F_PCM_BCLK_SEL_POS)) /**< MXC_F_PCM_BCLK_SEL BCLK master*/

#define MXC_F_PCM_BCLK_MASTER_SEL_POS 7 /**< MXC_F_PCM_BCLK_MASTER_SEL Position */
#define MXC_F_PCM_BCLK_MASTER_SEL_AUDIO_CLK \
    ((uint32_t)(0x00UL                      \
                << MXC_F_PCM_BCLK_MASTER_SEL_POS)) /**< MXC_F_PCM_BCLK_MASTER_SEL Audio Clock*/
#define MXC_F_PCM_BCLK_MASTER_SEL_MODULATOR_CLK \
    ((uint32_t)(0x01UL                          \
                << MXC_F_PCM_BCLK_MASTER_SEL_POS)) /**< MXC_F_PCM_BCLK_MASTER_SEL Modulator Clock*/

/**@} end of group AUDIO_PCM_CLOCK_DIVIDERS_MSB */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_CLOCK_DIVIDERS_LSB AUDIO_PCM_CLOCK_DIVIDERS_LSB
 * @brief    PCM Clock Dividers LSB
 * @{
 */

#define MXC_F_PCM_BCLK_DIV_LSB_POS 0 /**< MXC_F_PCM_BCLK_DIV_MSB Position */
#define MXC_F_PCM_BCLK_DIV_LSB \
    ((uint32_t)(0x01UL << MXC_F_PCM_BCLK_DIV_MSB_POS)) /**< MXC_F_PCM_BCLK_DIV_MSB */

/**@} end of group AUDIO_PCM_CLOCK_DIVIDERS_LSB */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_CLOCK_SET_UP AUDIO_PCM_CLOCK_SET_UP
 * @brief    PCM Clock Config
 * @{
 */

#define MXC_F_PCM_BSEL_POS 0 /**< MXC_F_PCM_BSEL Position */
#define MXC_F_PCM_BSEL_32 \
    ((uint32_t)(0x02UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 32 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_48 \
    ((uint32_t)(0x03UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 48 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_64 \
    ((uint32_t)(0x04UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 64 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_96 \
    ((uint32_t)(0x05UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 96 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_128 \
    ((uint32_t)(0x06UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 128 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_192 \
    ((uint32_t)(0x07UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 192 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_256 \
    ((uint32_t)(0x08UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 256 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_384 \
    ((uint32_t)(0x09UL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 384 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_512 \
    ((uint32_t)(0x0AUL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 512 BCLK pulses per LRCLK*/
#define MXC_F_PCM_BSEL_320 \
    ((uint32_t)(0x0BUL << MXC_F_PCM_BSEL_POS)) /**< MXC_F_PCM_BSEL Mask 320 BCLK pulses per LRCLK*/

