obones/max32666toy/audio_regs.h
#define MXC_F_PCM_BCLKEDGE_POS 4 /**< MXC_F_PCM_BCLKEDGE Position */
#define MXC_F_PCM_BCLKEDGE \
    ((uint32_t)(0x01UL << MXC_F_PCM_BCLKEDGE_POS)) /**< MXC_F_PCM_BCLKEDGE Mask */

/**@} end of group AUDIO_PCM_CLOCK_SET_UP */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_CONFIG AUDIO_PCM_CONFIG
 * @brief    PCM Config
 * @{
 */

#define MXC_F_PCM_TX_EXTRA_HIZ_POS 0 /**< MXC_F_PCM_TX_EXTRA_HIZ Position */
#define MXC_F_PCM_TX_EXTRA_HIZ \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_EXTRA_HIZ_POS)) /**< MXC_F_PCM_TX_EXTRA_HIZ Mask */

#define MXC_F_PCM_CHANSEL_POS 2 /**< MXC_F_PCM_CHANSEL Position */
#define MXC_F_PCM_CHANSEL \
    ((uint32_t)(0x01UL << MXC_F_PCM_CHANSEL_POS)) /**< MXC_F_PCM_CHANSEL Mask */

#define MXC_F_PCM_FORMATX_POS 3 /**< MXC_F_PCM_BSEL Position */
#define MXC_F_PCM_FORMATX_I2S \
    ((uint32_t)(0x00UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX I2S Format*/
#define MXC_F_PCM_FORMATX_PCM_LEFT \
    ((uint32_t)(0x01UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX PCM justified*/
#define MXC_F_PCM_FORMATX_PCM_RIGHT \
    ((uint32_t)(0x02UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX PCM right justified*/
#define MXC_F_PCM_FORMATX_TDM_MODE_1 \
    ((uint32_t)(0x03UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX TDM mode 1*/
#define MXC_F_PCM_FORMATX_TDM_MODE_2 \
    ((uint32_t)(0x04UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX TDM mode 2*/
#define MXC_F_PCM_FORMATX_TDM_MODE_3 \
    ((uint32_t)(0x05UL << MXC_F_PCM_FORMATX_POS)) /**< MXC_F_PCM_FORMATX TDM mode 3*/

#define MXC_F_PCM_CHANSZ_POS 6 /**< MXC_F_PCM_CHANSZ Position */
#define MXC_F_PCM_CHANSZ_16 \
    ((uint32_t)(0x01UL << MXC_F_PCM_CHANSZ_POS)) /**< MXC_F_PCM_CHANSZ 16-bit*/
#define MXC_F_PCM_CHANSZ_24 \
    ((uint32_t)(0x02UL << MXC_F_PCM_CHANSZ_POS)) /**< MXC_F_PCM_CHANSZ 24-bit*/
#define MXC_F_PCM_CHANSZ_32 \
    ((uint32_t)(0x03UL << MXC_F_PCM_CHANSZ_POS)) /**< MXC_F_PCM_CHANSZ 32-bit*/

/**@} end of group AUDIO_PCM_CONFIG */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_TX_SAMPLE_RATES AUDIO_PCM_TX_SAMPLE_RATES
 * @brief    PCM Tx Sample Rates
 * @{
 */

#define MXC_F_PCM_TX_INTERFACE_SR_POS 0 /**< MXC_F_PCM_TX_INTERFACE_SR Position */
#define MXC_F_PCM_TX_INTERFACE_SR_8 \
    ((uint32_t)(0x00UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 8kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_11_025 \
    ((uint32_t)(0x01UL                   \
                << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 11.025kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_12 \
    ((uint32_t)(0x02UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 12kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_16 \
    ((uint32_t)(0x03UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 16kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_22_05 \
    ((uint32_t)(0x04UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 22.05kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_24 \
    ((uint32_t)(0x05UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 24kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_32 \
    ((uint32_t)(0x06UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 32kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_44_1 \
    ((uint32_t)(0x07UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 44.1kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_48 \
    ((uint32_t)(0x08UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 48kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_88_2 \
    ((uint32_t)(0x09UL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 88.2kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_96 \
    ((uint32_t)(0x0AUL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 96kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_176_4 \
    ((uint32_t)(0x0BUL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 176.4kHz */
#define MXC_F_PCM_TX_INTERFACE_SR_192 \
    ((uint32_t)(0x0CUL << MXC_F_PCM_TX_INTERFACE_SR_POS)) /**< MXC_F_PCM_TX_INTERFACE_SR 192kHz */

#define MXC_F_PCM_TX_DATAPORT_SR_POS 4 /**< MXC_F_PCM_TX_DATAPORT_SR Position */
#define MXC_F_PCM_TX_DATAPORT_SR_8 \
    ((uint32_t)(0x00UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 8kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_11_025 \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 11.025kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_12 \
    ((uint32_t)(0x02UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 12kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_16 \
    ((uint32_t)(0x03UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 16kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_22_05 \
    ((uint32_t)(0x04UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 22.05kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_24 \
    ((uint32_t)(0x05UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 24kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_32 \
    ((uint32_t)(0x06UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 32kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_44_1 \
    ((uint32_t)(0x07UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 44.1kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_48 \
    ((uint32_t)(0x08UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 48kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_88_2 \
    ((uint32_t)(0x09UL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 88.2kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_96 \
    ((uint32_t)(0x0AUL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 96kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_176_4 \
    ((uint32_t)(0x0BUL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 176.4kHz */
#define MXC_F_PCM_TX_DATAPORT_SR_192 \
    ((uint32_t)(0x0CUL << MXC_F_PCM_TX_DATAPORT_SR_POS)) /**< MXC_F_PCM_TX_DATAPORT_SR 192kHz */

/**@} end of group AUDIO_PCM_TX_SAMPLE_RATES */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_RX_SAMPLE_RATES AUDIO_PCM_RX_SAMPLE_RATES
 * @brief    PCM Rx Sample Rates
 * @{
 */

#define MXC_F_PCM_RX_INTERFACE_SR_POS 0 /**< MXC_F_PCM_RX_INTERFACE_SR Position */
#define MXC_F_PCM_RX_INTERFACE_SR_8 \
    ((uint32_t)(0x00UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 8kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_11_025 \
    ((uint32_t)(0x01UL                   \
                << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 11.025kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_12 \
    ((uint32_t)(0x02UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 12kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_16 \
    ((uint32_t)(0x03UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 16kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_22_05 \
    ((uint32_t)(0x04UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 22.05kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_24 \
    ((uint32_t)(0x05UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 24kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_32 \
    ((uint32_t)(0x06UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 32kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_44_1 \
    ((uint32_t)(0x07UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 44.1kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_48 \
    ((uint32_t)(0x08UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 48kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_88_2 \
    ((uint32_t)(0x09UL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 88.2kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_96 \
    ((uint32_t)(0x0AUL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 96kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_176_4 \
    ((uint32_t)(0x0BUL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 176.4kHz */
#define MXC_F_PCM_RX_INTERFACE_SR_192 \
    ((uint32_t)(0x0CUL << MXC_F_PCM_RX_INTERFACE_SR_POS)) /**< MXC_F_PCM_RX_INTERFACE_SR 192kHz */

#define MXC_F_PCM_RX_DATAPORT_SR_POS 4 /**< MXC_F_PCM_RX_DATAPORT_SR Position */
#define MXC_F_PCM_RX_DATAPORT_SR_8 \
    ((uint32_t)(0x00UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 8kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_11_025 \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 11.025kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_12 \
    ((uint32_t)(0x02UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 12kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_16 \
    ((uint32_t)(0x03UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 16kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_22_05 \
    ((uint32_t)(0x04UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 22.05kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_24 \
    ((uint32_t)(0x05UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 24kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_32 \
    ((uint32_t)(0x06UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 32kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_44_1 \
    ((uint32_t)(0x07UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 44.1kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_48 \
    ((uint32_t)(0x08UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 48kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_88_2 \
    ((uint32_t)(0x09UL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 88.2kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_96 \
    ((uint32_t)(0x0AUL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 96kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_176_4 \
    ((uint32_t)(0x0BUL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 176.4kHz */
#define MXC_F_PCM_RX_DATAPORT_SR_192 \
    ((uint32_t)(0x0CUL << MXC_F_PCM_RX_DATAPORT_SR_POS)) /**< MXC_F_PCM_RX_DATAPORT_SR 192kHz */

/**@} end of group AUDIO_PCM_RX_SAMPLE_RATES */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_RX_ENABLES_BYTE_0 AUDIO_PCM_RX_ENABLES_BYTE_0
 * @brief    PCM Rx Channels Enable Byte 0
 * @{
 */

#define MXC_F_PCM_RX_CH0_EN_POS 0 /**< MXC_F_PCM_RX_CH0_EN Position */
#define MXC_F_PCM_RX_CH0_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH0_EN_POS)) /**< MXC_F_PCM_RX_CH0_EN */

