obones/max32666toy/audio_regs.h
#define MXC_F_PCM_RX_CH1_EN_POS 1 /**< MXC_F_PCM_RX_CH1_EN Position */
#define MXC_F_PCM_RX_CH1_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH1_EN_POS)) /**< MXC_F_PCM_RX_CH1_EN */

#define MXC_F_PCM_RX_CH2_EN_POS 2 /**< MXC_F_PCM_RX_CH2_EN Position */
#define MXC_F_PCM_RX_CH2_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH2_EN_POS)) /**< MXC_F_PCM_RX_CH2_EN */

#define MXC_F_PCM_RX_CH3_EN_POS 3 /**< MXC_F_PCM_RX_CH3_EN Position */
#define MXC_F_PCM_RX_CH3_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH3_EN_POS)) /**< MXC_F_PCM_RX_CH3_EN */

#define MXC_F_PCM_RX_CH4_EN_POS 4 /**< MXC_F_PCM_RX_CH4_EN Position */
#define MXC_F_PCM_RX_CH4_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH4_EN_POS)) /**< MXC_F_PCM_RX_CH4_EN */

#define MXC_F_PCM_RX_CH5_EN_POS 5 /**< MXC_F_PCM_RX_CH5_EN Position */
#define MXC_F_PCM_RX_CH5_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH5_EN_POS)) /**< MXC_F_PCM_RX_CH5_EN */

#define MXC_F_PCM_RX_CH6_EN_POS 6 /**< MXC_F_PCM_RX_CH6_EN Position */
#define MXC_F_PCM_RX_CH6_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH6_EN_POS)) /**< MXC_F_PCM_RX_CH6_EN */

#define MXC_F_PCM_RX_CH7_EN_POS 7 /**< MXC_F_PCM_RX_CH7_EN Position */
#define MXC_F_PCM_RX_CH7_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH7_EN_POS)) /**< MXC_F_PCM_RX_CH7_EN */

/**@} end of group AUDIO_PCM_RX_ENABLES_BYTE_0 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_RX_ENABLES_BYTE_1 AUDIO_PCM_RX_ENABLES_BYTE_1
 * @brief    PCM Rx Channels Enable Byte 1
 * @{
 */

#define MXC_F_PCM_RX_CH8_EN_POS 0 /**< MXC_F_PCM_RX_CH8_EN Position */
#define MXC_F_PCM_RX_CH8_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH8_EN_POS)) /**< MXC_F_PCM_RX_CH8_EN */

#define MXC_F_PCM_RX_CH9_EN_POS 1 /**< MXC_F_PCM_RX_CH9_EN Position */
#define MXC_F_PCM_RX_CH9_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH9_EN_POS)) /**< MXC_F_PCM_RX_CH9_EN */

#define MXC_F_PCM_RX_CH10_EN_POS 2 /**< MXC_F_PCM_RX_CH10_EN Position */
#define MXC_F_PCM_RX_CH10_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH10_EN_POS)) /**< MXC_F_PCM_RX_CH10_EN */

#define MXC_F_PCM_RX_CH11_EN_POS 3 /**< MXC_F_PCM_RX_CH11_EN Position */
#define MXC_F_PCM_RX_CH11_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH11_EN_POS)) /**< MXC_F_PCM_RX_CH11_EN */

#define MXC_F_PCM_RX_CH12_EN_POS 4 /**< MXC_F_PCM_RX_CH12_EN Position */
#define MXC_F_PCM_RX_CH12_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH12_EN_POS)) /**< MXC_F_PCM_RX_CH12_EN */

#define MXC_F_PCM_RX_CH13_EN_POS 5 /**< MXC_F_PCM_RX_CH13_EN Position */
#define MXC_F_PCM_RX_CH13_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH13_EN_POS)) /**< MXC_F_PCM_RX_CH13_EN */

#define MXC_F_PCM_RX_CH14_EN_POS 6 /**< MXC_F_PCM_RX_CH14_EN Position */
#define MXC_F_PCM_RX_CH14_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH14_EN_POS)) /**< MXC_F_PCM_RX_CH14_EN */

#define MXC_F_PCM_RX_CH15_EN_POS 7 /**< MXC_F_PCM_RX_CH15_EN Position */
#define MXC_F_PCM_RX_CH15_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_RX_CH15_EN_POS)) /**< MXC_F_PCM_RX_CH15_EN */

/**@} end of group AUDIO_PCM_RX_ENABLES_BYTE_1 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_TX_ENABLES_BYTE_0 AUDIO_PCM_TX_ENABLES_BYTE_0
 * @brief    PCM Tx Channels Enable Byte 0
 * @{
 */

#define MXC_F_PCM_TX_CH0_EN_POS 0 /**< MXC_F_PCM_TX_CH0_EN Position */
#define MXC_F_PCM_TX_CH0_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH0_EN_POS)) /**< MXC_F_PCM_TX_CH0_EN */

#define MXC_F_PCM_TX_CH1_EN_POS 1 /**< MXC_F_PCM_TX_CH1_EN Position */
#define MXC_F_PCM_TX_CH1_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH1_EN_POS)) /**< MXC_F_PCM_TX_CH1_EN */

#define MXC_F_PCM_TX_CH2_EN_POS 2 /**< MXC_F_PCM_TX_CH2_EN Position */
#define MXC_F_PCM_TX_CH2_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH2_EN_POS)) /**< MXC_F_PCM_TX_CH2_EN */

#define MXC_F_PCM_TX_CH3_EN_POS 3 /**< MXC_F_PCM_TX_CH3_EN Position */
#define MXC_F_PCM_TX_CH3_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH3_EN_POS)) /**< MXC_F_PCM_TX_CH3_EN */

#define MXC_F_PCM_TX_CH4_EN_POS 4 /**< MXC_F_PCM_TX_CH4_EN Position */
#define MXC_F_PCM_TX_CH4_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH4_EN_POS)) /**< MXC_F_PCM_TX_CH4_EN */

#define MXC_F_PCM_TX_CH5_EN_POS 5 /**< MXC_F_PCM_TX_CH5_EN Position */
#define MXC_F_PCM_TX_CH5_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH5_EN_POS)) /**< MXC_F_PCM_TX_CH5_EN */

#define MXC_F_PCM_TX_CH6_EN_POS 6 /**< MXC_F_PCM_TX_CH6_EN Position */
#define MXC_F_PCM_TX_CH6_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH6_EN_POS)) /**< MXC_F_PCM_TX_CH6_EN */

#define MXC_F_PCM_TX_CH7_EN_POS 7 /**< MXC_F_PCM_TX_CH7_EN Position */
#define MXC_F_PCM_TX_CH7_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH7_EN_POS)) /**< MXC_F_PCM_TX_CH7_EN */

/**@} end of group AUDIO_PCM_TX_ENABLES_BYTE_0 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_TX_ENABLES_BYTE_1 AUDIO_PCM_TX_ENABLES_BYTE_1
 * @brief    PCM Tx Channels Enable Byte 1
 * @{
 */

#define MXC_F_PCM_TX_CH8_EN_POS 0 /**< MXC_F_PCM_TX_CH8_EN Position */
#define MXC_F_PCM_TX_CH8_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH8_EN_POS)) /**< MXC_F_PCM_TX_CH8_EN */

#define MXC_F_PCM_TX_CH9_EN_POS 1 /**< MXC_F_PCM_TX_CH9_EN Position */
#define MXC_F_PCM_TX_CH9_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH9_EN_POS)) /**< MXC_F_PCM_TX_CH9_EN */

#define MXC_F_PCM_TX_CH10_EN_POS 2 /**< MXC_F_PCM_TX_CH10_EN Position */
#define MXC_F_PCM_TX_CH10_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH10_EN_POS)) /**< MXC_F_PCM_TX_CH10_EN */

#define MXC_F_PCM_TX_CH11_EN_POS 3 /**< MXC_F_PCM_TX_CH11_EN Position */
#define MXC_F_PCM_TX_CH11_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH11_EN_POS)) /**< MXC_F_PCM_TX_CH11_EN */

#define MXC_F_PCM_TX_CH12_EN_POS 4 /**< MXC_F_PCM_TX_CH12_EN Position */
#define MXC_F_PCM_TX_CH12_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH12_EN_POS)) /**< MXC_F_PCM_TX_CH12_EN */

#define MXC_F_PCM_TX_CH13_EN_POS 5 /**< MXC_F_PCM_TX_CH13_EN Position */
#define MXC_F_PCM_TX_CH13_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH13_EN_POS)) /**< MXC_F_PCM_TX_CH13_EN */

#define MXC_F_PCM_TX_CH14_EN_POS 6 /**< MXC_F_PCM_TX_CH14_EN Position */
#define MXC_F_PCM_TX_CH14_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH14_EN_POS)) /**< MXC_F_PCM_TX_CH14_EN */

#define MXC_F_PCM_TX_CH15_EN_POS 7 /**< MXC_F_PCM_TX_CH15_EN Position */
#define MXC_F_PCM_TX_CH15_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_TX_CH15_EN_POS)) /**< MXC_F_PCM_TX_CH15_EN */

/**@} end of group AUDIO_PCM_TX_ENABLES_BYTE_1 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_0 AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_0
 * @brief    Dataport 1 Slot Mapping Registers Channel 0
 * @{
 */

#define MXC_F_PCM_DPORT1_SLOT_MAP_CH0_POS 0 /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH0 Position */
#define MXC_F_PCM_DPORT1_SLOT_MAP_CH0 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT1_SLOT_MAP_CH0_POS)) /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH0 */

#define MXC_F_PCM_DPORT1_CH0_EN_POS 7 /**< MXC_F_PCM_DPORT1_CH0_EN Position */
#define MXC_F_PCM_DPORT1_CH0_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT1_CH0_EN_POS)) /**< MXC_F_PCM_DPORT1_CH0_EN */

